In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('adult.data.csv')

In [3]:
df.shape

(32561, 15)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [4]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

#### How many of each race are represented in this dataset? 
This should be a Pandas series with race names as the index labels.

In [7]:
race_count = df["race"].value_counts()
race_count

White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
Name: race, dtype: int64

#### What is the average age of men?

In [8]:
df["sex"].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

In [16]:
df[df["sex"]=="Male"]["age"].mean()

39.43354749885268

In [18]:
average_age_men = round(df[df["sex"]=="Male"]["age"].mean(),1)
average_age_men

39.43354749885268

#### What is the percentage of people who have a Bachelor's degree?

In [19]:
df["education"].value_counts()

HS-grad         10501
Some-college     7291
Bachelors        5355
Masters          1723
Assoc-voc        1382
11th             1175
Assoc-acdm       1067
10th              933
7th-8th           646
Prof-school       576
9th               514
12th              433
Doctorate         413
5th-6th           333
1st-4th           168
Preschool          51
Name: education, dtype: int64

In [43]:
df2 = df.groupby(["education"]).count()
df2["%"] = (df2["age"]/df2["age"].sum())*100

In [45]:
df2["%"]["Bachelors"]

16.44605509658794

In [47]:
percentage_bachelors = round(df2["%"]["Bachelors"],1)
percentage_bachelors

16.4

#### What percentage of people with advanced education (`Bachelors`, `Masters`, or `Doctorate`) make more than 50K?

In [91]:
df["salary"].value_counts()

<=50K    24720
>50K      7841
Name: salary, dtype: int64

In [111]:
edu_list = ["Bachelors", "Masters", "Doctorate"]
df3 = df[(df["education"].isin(edu_list))& (df["salary"]==">50K")]
df4 = df[(df["education"].isin(edu_list))]

In [112]:
df3.shape

(3486, 15)

In [113]:
df4.shape

(7491, 15)

In [114]:
round(df3.shape[0]/df4.shape[0]*100,1)

46.5

In [115]:
higher_education = round(df3.shape[0]/df4.shape[0]*100,1)

#### What percentage of people without advanced education make more than 50K?

In [116]:
df5 = df[(~df["education"].isin(edu_list))& (df["salary"]==">50K")]
df6 = df[(~df["education"].isin(edu_list))]

In [117]:
df5.shape

(4355, 15)

In [118]:
df6.shape

(25070, 15)

In [119]:
lower_education = round(df5.shape[0]/df6.shape[0]*100,1)
lower_education

17.4

#### What is the minimum number of hours a person works per week (hours-per-week feature)?

In [120]:
df["hours-per-week"].value_counts()

40    15217
50     2819
45     1824
60     1475
35     1297
      ...
82        1
92        1
87        1
74        1
94        1
Name: hours-per-week, Length: 94, dtype: int64

In [122]:
min_work_hours = df["hours-per-week"].min()
min_work_hours

1

#### What percentage of the people who work the minimum number of hours per week have a salary of >50K?

In [130]:
num_min_workers = df[df["hours-per-week"] == df["hours-per-week"].min()]
num_min_workers.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
189,58,State-gov,109567,Doctorate,16,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,1,United-States,>50K
1036,66,Self-emp-inc,150726,9th,5,Married-civ-spouse,Exec-managerial,Husband,White,Male,1409,0,1,?,<=50K
1262,69,?,195779,Assoc-voc,11,Widowed,?,Not-in-family,White,Female,0,0,1,United-States,<=50K
5590,78,?,363134,HS-grad,9,Widowed,?,Not-in-family,White,Female,0,0,1,United-States,<=50K
5632,45,?,189564,Masters,14,Married-civ-spouse,?,Wife,White,Female,0,0,1,United-States,<=50K

In [129]:
rich_percentage = round(len(num_min_workers[num_min_workers["salary"]==">50K"])/len(num_min_workers)*100,1)
rich_percentage

10.0

#### What country has the highest percentage of people that earn >50K?

In [131]:
df["native-country"].value_counts()

United-States                 29170
Mexico                          643
?                               583
Philippines                     198
Germany                         137
Canada                          121
Puerto-Rico                     114
El-Salvador                     106
India                           100
Cuba                             95
England                          90
Jamaica                          81
South                            80
China                            75
Italy                            73
Dominican-Republic               70
Vietnam                          67
Guatemala                        64
Japan                            62
Poland                           60
Columbia                         59
Taiwan                           51
Haiti                            44
Iran                             43
Portugal                         37
Nicaragua                        34
Peru                             31
France                           29
Greece                           29
Ecuador                          28
Ireland                          24
Hong                             20
Cambodia                         19
Trinadad&Tobago                  19
Laos                             18
Thailand                         18
Yugoslavia                       16
Outlying-US(Guam-USVI-etc)       14
Honduras                         13
Hungary                          13
Scotland                         12
Holand-Netherlands                1
Name: native-country, dtype: int64

In [156]:
# We want to filter the salary >50k for grouped countries result
df7 = df.groupby(["native-country","salary"]).count()
pct = lambda x: 100 * x / x.sum()
# df7
df8 = df7.groupby(["native-country"]).apply(pct)['age'].reset_index()
df8

   native-country salary        age
0               ?  <=50K  74.957118
1               ?   >50K  25.042882
2        Cambodia  <=50K  63.157895
3        Cambodia   >50K  36.842105
4          Canada  <=50K  67.768595
..            ...    ...        ...
77  United-States   >50K  24.583476
78        Vietnam  <=50K  92.537313
79        Vietnam   >50K   7.462687
80     Yugoslavia  <=50K  62.500000
81     Yugoslavia   >50K  37.500000

[82 rows x 3 columns]

In [161]:
df9 = df8[df8["salary"]== ">50K"].sort_values(by="age", ascending=False)

In [162]:
df9.head()

   native-country salary        age
40           Iran   >50K  41.860465
21         France   >50K  41.379310
38          India   >50K  40.000000
71         Taiwan   >50K  39.215686
48          Japan   >50K  38.709677

In [168]:
df9.iloc[0,0]

'Iran'

In [170]:
round(df9.iloc[0,-1],1)

41.9

In [171]:
highest_earning_country = df9.iloc[0,0]
highest_earning_country_percentage = round(df9.iloc[0,-1],1)

#### Identify the most popular occupation for those who earn >50K in India.

In [190]:
df10 = df.groupby(["native-country", "salary"]).get_group(("India", ">50K"))
df10 = df10.groupby(["occupation"])["age"].count().sort_values(ascending=False)
df10

occupation
Prof-specialty      25
Exec-managerial      8
Other-service        2
Tech-support         2
Adm-clerical         1
Sales                1
Transport-moving     1
Name: age, dtype: int64

In [191]:
top_IN_occupation = df10.index[0]

In [192]:
top_IN_occupation

'Prof-specialty'